{
  "backend/main.mo": "Main Motoko actor implementing a video-sharing platform with user profiles, video uploads (including 'Vidles' with aspect ratio and duration validation), likes, comments, follows, messaging, and role-based access control using mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features for error handling and routing fixes, including error boundaries, React Query error handling, null checks in pages, router configuration, and authentication defensive checks.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing components, pages, hooks, and configuration for a neon-themed video-sharing app with authentication, video upload, profiles, messaging, and error handling.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color variables for light and dark themes, including neon-inspired color palette and custom styling for borders, backgrounds, and UI components.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the SkelUlt application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for feed, vidles, profile, video detail, messages, and 404 pages, wrapped in ErrorBoundary, ThemeProvider, and QueryClientProvider with diagnostic logging.",
  "frontend/src/components/ChatThread.tsx": "Chat thread component displaying message history with recipient header, scrollable message list with auto-scroll on new messages, loading skeletons, and message input for a specific recipient.",
  "frontend/src/components/CommentInput.tsx": "Comment input form with textarea and submit button that posts comments to videos, includes authentication check, loading states, and toast notifications for success/error feedback.",
  "frontend/src/components/CommentSection.tsx": "Displays a scrollable list of comments for a video, showing author avatars, usernames, timestamps, and comment text with navigation to user profiles.",
  "frontend/src/components/ConversationList.tsx": "Shows a list of message conversation partners with avatars, usernames, last message previews, and timestamps, allowing selection of a conversation.",
  "frontend/src/components/EditProfileModal.tsx": "Modal dialog for editing user profile including username, bio, and profile picture upload with preview and validation.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches and displays errors with a reload button and expandable error details.",
  "frontend/src/components/FollowButton.tsx": "Button component for following/unfollowing users with optimistic UI updates, loading states, and authentication checks.",
  "frontend/src/components/Layout.tsx": "Main application layout with header navigation, logo, theme toggle, and authenticated/unauthenticated route buttons including upload modal trigger.",
  "frontend/src/components/LikeButton.tsx": "Button for liking videos with optimistic UI updates, like count display, and authentication requirement checks.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/MessageBubble.tsx": "Displays a chat message bubble with content, optional video link, and timestamp. Styles differ based on whether the message is from the current user or recipient.",
  "frontend/src/components/MessageInput.tsx": "Provides a message composition form with textarea, video attachment button, and send button. Integrates with VideoLinkPicker to attach videos to messages.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time users to create their profile by entering a username and optional bio. Cannot be dismissed until profile is created.",
  "frontend/src/components/ShareButton.tsx": "Button component that copies a video's URL to the clipboard when clicked, displaying a toast notification on success.",
  "frontend/src/components/VideoCard.tsx": "Card component displaying video with player, uploader info, title, description, and interaction buttons (like, comment, share, delete). Shows Vidle badge for vertical short-form content.",
  "frontend/src/components/VideoGrid.tsx": "Grid layout displaying video thumbnails with play overlay, Vidle badges, and delete buttons for owned videos. Includes confirmation dialog for deletion.",
  "frontend/src/components/VideoLinkPicker.tsx": "Modal dialog that displays the user's uploaded videos in a grid, allowing selection of a video to attach to a message.",
  "frontend/src/components/VideoUploadModal.tsx": "Modal for uploading videos with title, description, tags, and content type selection (video or Vidle). Validates Vidle uploads for 9:16 aspect ratio and 5-150 second duration.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, videos, comments, messages, follows, and likes with mutations that invalidate relevant query caches and show toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with neon-inspired light/dark theme using OKLCH color space, custom utility classes for neon glow effects, gradients, and styled scrollbars.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/FeedPage.tsx": "Displays a feed of most-liked videos with loading and error states, and conditionally shows a profile setup modal for authenticated users without profiles.",
  "frontend/src/pages/MessagingPage.tsx": "Authenticated messaging page with a two-column layout showing conversation list and chat thread, redirecting unauthenticated users to home.",
  "frontend/src/pages/ProfilePage.tsx": "Displays user profile with avatar, bio, stats, and video grid; shows edit button for own profile and follow button for others, with loading and error states.",
  "frontend/src/pages/VideoDetailPage.tsx": "Displays a single video with player, metadata (title, description, tags), uploader profile info, like/share buttons, and comment section. Handles loading, error, and not-found states with navigation back to feed.",
  "frontend/src/pages/VidlesPage.tsx": "Displays a feed of short-form vertical videos (Vidles) with authentication checks and profile setup modal. Shows empty state prompting users to upload first Vidle if none exist.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, neon-themed shadows, extended border radius values, custom animations, and typography/container plugins.",
  "project_state.json": "Project metadata defining SkelUlt as a unified social video platform with features list, architectural notes about messaging/video systems, and a known white screen rendering issue after Version 5 deployment."
}