{
  "backend/main.mo": "Main actor implementing a social video platform with user profiles, video uploads (including 'vidles'), follow/unfollow, likes, comments, messaging, and friend request system with access control and blob storage integration.",
  "backend/migration.mo": "Migration module that adds a friendRequests map to the actor state while preserving existing data structures for profiles, videos, followers, likes, comments, and messages.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of friend system components including React Query hooks, AddFriendsModal, FriendRequestsList, FriendsList, and their integration into MessagingPage.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components (Layout, VideoCard, modals), pages (FeedPage, ProfilePage, MessagingPage), styling (neon-themed CSS), and configuration files.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode CSS variables for background, foreground, primary, secondary, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'SkelUlt' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for feed, vidles, profile, video detail, messages, and 404 pages, wrapped in ThemeProvider, QueryClientProvider, ErrorBoundary, and Layout with Toaster.",
  "frontend/src/components/AddFriendsModal.tsx": "Modal dialog for searching users by username and sending friend requests. Currently has a limitation where it tracks sent requests by username but needs Principal to actually send requests to the backend.",
  "frontend/src/components/ChatThread.tsx": "Displays a chat conversation with a specific user, showing their profile header, message history with auto-scroll, and an option to send friend requests if not already friends.",
  "frontend/src/components/CommentInput.tsx": "Form component for posting comments on videos with authentication check, textarea input, and submit button with loading states.",
  "frontend/src/components/CommentSection.tsx": "Displays a scrollable list of video comments with author avatars, usernames, timestamps, and comment text. Shows loading state and empty state when no comments exist.",
  "frontend/src/components/ConversationList.tsx": "Displays a list of conversation partners with avatars, last message preview, timestamps, and friend badges. Supports selection to open a specific chat thread.",
  "frontend/src/components/EditProfileModal.tsx": "Modal dialog for editing user profile including username, bio, and profile picture upload with image preview. Handles file validation and profile update submission.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches rendering errors and displays a fallback UI with error details and a reload button.",
  "frontend/src/components/FollowButton.tsx": "A button component that allows users to follow/unfollow other users, with optimistic UI updates, authentication checks, and toast notifications for success/error states.",
  "frontend/src/components/FriendRequestsList.tsx": "Displays a list of pending friend requests with accept/decline actions, showing user avatars and usernames fetched from profiles.",
  "frontend/src/components/FriendsList.tsx": "Shows a scrollable list of friends with unfriend functionality, including a confirmation dialog before removing a friend.",
  "frontend/src/components/Layout.tsx": "Main application layout component with sticky header navigation, logo, theme toggle, and conditional rendering of authenticated routes (messages, profile, upload).",
  "frontend/src/components/LikeButton.tsx": "A like button for videos with optimistic updates, authentication checks, and prevents duplicate likes with visual feedback.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity authentication with login/logout functionality, loading states, and query cache clearing on logout.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with timestamp, optional video link, and different styling for own vs. received messages.",
  "frontend/src/components/MessageInput.tsx": "Message composition form with textarea input, video attachment picker, and send functionality for chat conversations.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to create their profile with username (required) and bio (optional) fields. Submits profile data using useSaveUserProfile mutation and displays loading/error states.",
  "frontend/src/components/ShareButton.tsx": "Button component that copies a video's URL to the clipboard when clicked. Displays a share icon and shows toast notifications for success/failure.",
  "frontend/src/components/VideoCard.tsx": "Card component displaying video details with thumbnail, uploader info, like/share buttons, and follow/unfollow functionality. Includes delete confirmation dialog for own videos and navigation to video detail page.",
  "frontend/src/components/VideoGrid.tsx": "Grid layout component for displaying videos in a responsive 3-column layout. Each grid item shows video thumbnail with play overlay, Vidle badge, and delete button for owned videos.",
  "frontend/src/components/VideoLinkPicker.tsx": "Modal dialog that displays a user's uploaded videos in a grid for selection. Used for linking videos in comments or other contexts.",
  "frontend/src/components/VideoUploadModal.tsx": "Modal for uploading videos with title, description, tags, and content type (video/vidle) fields. Validates Vidle uploads for 9:16 aspect ratio and 5s-2:30min duration, shows upload progress, and handles file validation.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on authentication state. Invalidates dependent queries when identity changes and initializes access control with admin token.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, videos, comments, likes, follows, friends, and messaging with mutations and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with neon-inspired light/dark theme using OKLCH color space, custom utilities for neon glow effects, gradients, and scrollbar styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/FeedPage.tsx": "Displays a feed of most-liked videos with loading states, error handling, and triggers profile setup modal for authenticated users without profiles.",
  "frontend/src/pages/MessagingPage.tsx": "Messaging interface with tabs for conversations and friends list, displays friend requests with badge count, and includes add friends modal functionality.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page showing avatar, username, bio, stats, and video grid with edit functionality for own profile and follow button for other users.",
  "frontend/src/pages/VideoDetailPage.tsx": "Displays a single video with player, metadata (title, description, tags), uploader profile info, engagement buttons (like/share), and comment section. Includes loading states, error handling, and navigation back to feed.",
  "frontend/src/pages/VidlesPage.tsx": "Displays a feed of short-form vertical videos (Vidles) with engagement features, profile setup modal for authenticated users, and empty state prompting first upload. Includes loading/error states and profile integration.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH, extended border radii, neon shadow effects, custom animations, and typography/container plugins.",
  "project_state.json": "Project metadata for SkelUlt social video platform documenting architecture (multi-platform video hosting, messaging, vidles), existing features (auth, profiles, uploads, engagement), and known issues (white screen, delete button failures)."
}