{
  "backend/main.mo": "Main backend actor implementing video sharing platform with user profiles, video uploads, likes, comments, follows, and messaging; includes storage and authorization mixins with access control.",
  "feature_evidence.json": "Feature evidence report documenting three delete video features: trash icon in VideoCard, delete functionality with confirmation dialog, and trash icon in VideoGrid thumbnails for authenticated users' own videos.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration files for the video sharing application with neon-themed UI.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system variables for light and dark themes, including neon-inspired colors and custom styling for borders and backgrounds.",
  "frontend/index.html": "HTML entry point for the SkelUlt application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for feed, profile, video detail, and messaging pages, wrapped in ThemeProvider with Toaster for notifications.",
  "frontend/src/components/ChatThread.tsx": "Chat thread component displaying message history with recipient header, scrollable message list with auto-scroll on new messages, and message input form.",
  "frontend/src/components/CommentInput.tsx": "Comment input form component with textarea and submit button that posts comments to videos with authentication check and loading states.",
  "frontend/src/components/CommentSection.tsx": "Scrollable comment section displaying comment list with author avatars, usernames, timestamps, and comment text with loading state and empty state handling.",
  "frontend/src/components/ConversationList.tsx": "Displays a scrollable list of conversation partners with avatars, usernames, last message previews, and timestamps. Includes loading skeletons and empty state handling.",
  "frontend/src/components/EditProfileModal.tsx": "Modal dialog for editing user profile including username, bio, and profile picture upload with image preview. Handles form validation and profile save mutations.",
  "frontend/src/components/FollowButton.tsx": "Toggle button for following/unfollowing users with optimistic UI updates, loading states, and validation to prevent self-following.",
  "frontend/src/components/Layout.tsx": "Main application layout with sticky header containing logo, navigation buttons (home, upload, messages, profile), theme toggle, and login button. Includes footer with social links.",
  "frontend/src/components/LikeButton.tsx": "Heart-shaped like button with optimistic UI updates, displays like count, and prevents duplicate likes with authentication checks.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that toggles between login and logout states using Internet Identity, with loading indicators and query cache clearing on logout.",
  "frontend/src/components/MessageBubble.tsx": "Chat message bubble component with different styling for own vs. received messages, displays timestamp, and includes optional video link with navigation.",
  "frontend/src/components/MessageInput.tsx": "Message composition area with textarea, send button, video attachment picker, and keyboard shortcuts (Enter to send). Handles message sending with video links.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to create their profile with username (required) and bio (optional) fields. Submits profile data using the useSaveCallerUserProfile hook and displays toast notifications for success/error states.",
  "frontend/src/components/ShareButton.tsx": "Button component that copies a video's URL to the clipboard when clicked. Uses the Share2 icon and displays toast notifications for success/error feedback.",
  "frontend/src/components/VideoCard.tsx": "Card component displaying video with thumbnail/player, uploader info, metadata (likes, comments, upload time), and interactive elements (like, share, delete). Navigates to video detail page on click and supports deletion for own videos with confirmation dialog.",
  "frontend/src/components/VideoGrid.tsx": "Grid layout component displaying videos as thumbnails with play overlay and delete button for own videos. Handles navigation to video detail pages and deletion with confirmation dialog.",
  "frontend/src/components/VideoLinkPicker.tsx": "Dialog component that displays a user's uploaded videos in a grid for selection. Used to pick videos to share in messages, with loading states and empty state handling.",
  "frontend/src/components/VideoUploadModal.tsx": "Modal dialog for uploading videos with form fields for title, description, tags, and video file selection. Handles file validation, upload progress tracking, and form submission using the useUploadVideo hook.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically recreates the actor when identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, videos (upload, fetch, delete), comments, likes, follows, and messaging with optimistic updates and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with neon-inspired light/dark theme using OKLCH color space, custom utility classes for neon glow effects, gradients, and custom scrollbar styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/FeedPage.tsx": "Displays a feed of most-liked videos with VideoCard components, shows loading states, handles empty states, and triggers ProfileSetupModal for authenticated users without profiles.",
  "frontend/src/pages/MessagingPage.tsx": "Implements a two-column messaging interface with ConversationList and ChatThread components, requiring authentication and redirecting unauthenticated users to home.",
  "frontend/src/pages/ProfilePage.tsx": "Displays user profile information with avatar, bio, stats, and video grid; supports editing own profile and following other users based on authentication state.",
  "frontend/src/pages/VideoDetailPage.tsx": "Displays a detailed video page with video player, uploader info, like/share buttons, and comments section. Fetches video data, uploader profile, and comments using custom hooks and provides navigation back to feed or to uploader's profile.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, neon-themed box shadows, custom border radii, animations, and typography/container query plugins for the social media platform's vibrant UI.",
  "project_state.json": "Project state document describing SkelUlt as a unified social media video platform with implemented features including authentication, profiles, video upload/feed, likes, comments, sharing, and follow system, with a known issue about missing video deletion buttons."
}