{
  "backend/main.mo": "Main backend actor implementing a video-sharing platform with user profiles, video uploads, likes, comments, follows, and messaging functionality using blob storage and access control mixins.",
  "feature_evidence.json": "Feature evidence report documenting implemented messaging features including navigation, conversation list, chat thread, message input, video link sharing, and 3-second polling for real-time updates.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration files for the SkelUlt video-sharing and messaging application.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark themes with neon-inspired styling.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the SkelUlt application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for feed, profile, video detail, and messaging pages, wrapped in ThemeProvider and Layout.",
  "frontend/src/components/ChatThread.tsx": "Chat thread component displaying message history with a recipient, auto-scrolling on new messages, and including header with recipient info and message input at bottom.",
  "frontend/src/components/CommentInput.tsx": "Comment input form component with textarea and submit button that posts comments to videos with authentication checks and loading states.",
  "frontend/src/components/CommentSection.tsx": "Displays a scrollable list of comments for a video, showing each comment with author avatar, username, timestamp, and text. Includes loading states and empty state messaging.",
  "frontend/src/components/ConversationList.tsx": "Renders a list of conversation partners with avatars, usernames, last message previews, and timestamps. Supports selection highlighting and includes loading/empty states.",
  "frontend/src/components/EditProfileModal.tsx": "Modal dialog for editing user profile including username, bio, and profile picture upload with preview. Handles form validation and profile picture conversion to ExternalBlob.",
  "frontend/src/components/FollowButton.tsx": "Toggle button for following/unfollowing users with optimistic UI updates, authentication checks, and prevents self-following. Shows loading states during mutations.",
  "frontend/src/components/Layout.tsx": "Main application layout with sticky header containing logo, navigation buttons (home, upload, messages, profile), theme toggle, and login button. Includes footer with social links.",
  "frontend/src/components/LikeButton.tsx": "Heart-shaped like button with counter that performs optimistic updates and prevents duplicate likes. Requires authentication and shows animated fill state when liked.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity authentication with login/logout functionality, loading states, and clears query cache on logout. Shows appropriate icons and text based on auth state.",
  "frontend/src/components/MessageBubble.tsx": "Displays individual chat message bubbles with different styling for own vs. received messages, includes timestamp and optional video link with navigation.",
  "frontend/src/components/MessageInput.tsx": "A message input component with text area, video attachment support, and send functionality. Handles message submission to a recipient Principal with optional video links via VideoLinkPicker.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog for first-time profile setup requiring username and optional bio. Non-dismissible modal that creates user profile on submission.",
  "frontend/src/components/ShareButton.tsx": "A button component that copies a video URL to clipboard for sharing. Displays a share icon and shows toast notifications on success/failure.",
  "frontend/src/components/VideoCard.tsx": "A card component displaying video with thumbnail, player controls, uploader info, title, description, tags, and interaction buttons (like, comment, share). Navigates to video detail or profile pages on click.",
  "frontend/src/components/VideoGrid.tsx": "A responsive grid layout component that displays video thumbnails with play overlays and basic metadata. Shows empty state when no videos are available.",
  "frontend/src/components/VideoLinkPicker.tsx": "A dialog component that displays the current user's uploaded videos in a grid for selection. Used to pick videos to share in messages.",
  "frontend/src/components/VideoUploadModal.tsx": "A modal dialog for uploading videos with title, description, tags, and file selection. Displays upload progress and converts files to ExternalBlob for backend submission.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when actor changes and initializes access control with admin token.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, videos, likes, comments, messages, and follows using the backend actor, with automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with neon-inspired light/dark theme using OKLCH color space, custom utility classes for neon glow effects, gradients, and custom scrollbar styling.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped in QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/src/pages/FeedPage.tsx": "Displays a feed of most-liked videos using VideoCard components, shows loading states, handles empty states, and conditionally renders ProfileSetupModal for authenticated users without profiles.",
  "frontend/src/pages/MessagingPage.tsx": "Messaging interface with a two-column layout showing ConversationList and ChatThread components, requiring authentication and redirecting unauthenticated users to home.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page displaying avatar, bio, stats, and video grid with conditional rendering of EditProfileModal for own profile or FollowButton for other users, using userId from route params.",
  "frontend/src/pages/VideoDetailPage.tsx": "Displays a detailed video page with video player, uploader profile info, like/share buttons, and comment section. Fetches video data, user profile, and comments using custom hooks and handles navigation back to feed or to uploader's profile.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support. Includes functions to get, store, clear, and persist parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, neon-inspired shadows, custom border radii, Inter font family, and neon pulse animations. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document for SkelUlt, a unified social media video platform combining features from multiple platforms. Lists implemented features including authentication, profiles, video upload/feed, likes, comments, sharing, following, and messaging system (SkelMsg)."
}