{
  "backend/main.mo": "Main backend actor implementing video sharing platform with user profiles, video uploads (including Vidle validation for 9:16 aspect ratio and 5-150 second duration), likes, comments, follow/unfollow functionality, and access control using mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: SkelUlt logo in Layout header, Enable/Disable follow button in VideoCard, smooth animation for follow button state transitions, and unfollow functionality.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components (Layout with SkelUlt logo, VideoCard with follow button, modals, video player), pages (Feed, Profile, VideoDetail, Messaging, Vidles), hooks for backend queries/mutations, and styling configuration.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system variables for light and dark modes, including background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'SkelUlt' title, root div for React mounting, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes (feed, vidles, profile, video detail, messages, 404), wrapping with ThemeProvider, QueryClientProvider, ErrorBoundary, Layout, and Toaster for notifications.",
  "frontend/src/components/ChatThread.tsx": "Chat thread component displaying message history with recipient profile header, scrollable message list with auto-scroll on new messages, loading skeletons, and MessageInput for sending new messages.",
  "frontend/src/components/CommentInput.tsx": "Comment input form with textarea and submit button that posts comments to videos using useCommentOnVideo hook, includes authentication check, validation, loading states, and toast notifications.",
  "frontend/src/components/CommentSection.tsx": "Displays a scrollable list of comments for a video, showing author avatars, usernames, timestamps, and comment text with navigation to user profiles.",
  "frontend/src/components/ConversationList.tsx": "Renders a list of message conversation partners with avatars, last message previews, and timestamps, allowing users to select a conversation.",
  "frontend/src/components/EditProfileModal.tsx": "Modal dialog for editing user profile including username, bio, and profile picture with image upload and preview functionality.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches and displays errors with a reload button and expandable error details.",
  "frontend/src/components/FollowButton.tsx": "Button component for following/unfollowing users with optimistic UI updates, loading states, and authentication checks.",
  "frontend/src/components/Layout.tsx": "Main application layout with sticky header containing logo, navigation buttons (Home, Vidles, Upload, Messages, Profile), theme toggle, and login button.",
  "frontend/src/components/LikeButton.tsx": "Heart-shaped like button for videos with optimistic updates, like count display, and authentication requirement.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/MessageBubble.tsx": "Displays a chat message bubble with content, optional video link, and timestamp. Styles differently for own vs. received messages.",
  "frontend/src/components/MessageInput.tsx": "Message composition form with textarea, video attachment picker, and send button. Handles message submission with optional video links.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile creation requiring username and optional bio. Cannot be dismissed until profile is created.",
  "frontend/src/components/ShareButton.tsx": "Button component that copies video URL to clipboard when clicked, with toast notification feedback.",
  "frontend/src/components/VideoCard.tsx": "Card component displaying video thumbnail, metadata, uploader info, and interactive elements (like, share, delete, follow). Handles video playback preview and navigation to detail page.",
  "frontend/src/components/VideoGrid.tsx": "Grid layout component displaying video thumbnails with play overlay, delete button for own videos, and Vidle badge. Includes delete confirmation dialog.",
  "frontend/src/components/VideoLinkPicker.tsx": "Dialog modal for selecting a video from user's uploaded videos to attach to a message. Shows grid of video thumbnails with titles and like counts.",
  "frontend/src/components/VideoUploadModal.tsx": "Modal for uploading videos with title, description, tags, and content type selection (video/vidle). Validates Vidle requirements (5s-2:30min duration, 9:16 aspect ratio) before upload.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for all backend operations including user profiles, videos, comments, messages, likes, follows, and notifications with proper error handling and cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with neon-inspired color schemes for light/dark modes, custom utility classes for glow effects and gradients, and global styling for scrollbars and animations.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/FeedPage.tsx": "Displays a feed of most-liked videos with loading and error states, and conditionally shows a profile setup modal for authenticated users without profiles.",
  "frontend/src/pages/MessagingPage.tsx": "Implements a two-column messaging interface with conversation list and chat thread, requiring authentication and redirecting unauthenticated users to home.",
  "frontend/src/pages/ProfilePage.tsx": "Displays user profile information with avatar, bio, stats, and video grid; shows edit button for own profile and follow button for other users.",
  "frontend/src/pages/VideoDetailPage.tsx": "Displays a single video with player, metadata (title, description, tags), uploader profile info, engagement buttons (like/share), and comment section. Handles loading, error, and not-found states with navigation back to feed.",
  "frontend/src/pages/VidlesPage.tsx": "Displays a feed of short-form vertical videos (Vidles) with engagement features, handles empty states, and shows a profile setup modal for authenticated users without profiles.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, neon shadow effects, custom animations, and typography/container query plugins.",
  "project_state.json": "Project metadata for SkelUlt social video platform documenting architecture (multi-platform video hosting, messaging, Vidles feature), known issues (white screen after v5), and implemented features list."
}