{
  "backend/main.mo": "Main backend actor implementing user profiles, video/vidle uploads with content type validation, social features (follow, like, comment), friend request system with pending/accepted/declined states, and access control integration using MixinStorage and MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to rendering FriendRequestsList in MessagingPage, verifying useGetFriendRequests hook integration, and adding neon-themed visual styling to the pending friend requests section.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including global neon-themed styles, React components for video cards/upload/comments, authentication, profile management, messaging, and page layouts with TanStack Router and React Query integration.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system variables for light and dark modes, including neon-inspired color palette with custom properties for background, foreground, primary, secondary, accent, destructive, border, and sidebar theming.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx, titled 'SkelUlt'.",
  "frontend/src/App.tsx": "Main React application with TanStack Router setup, routes for feed/vidles/profile/video/messages/404, QueryClientProvider, ThemeProvider, ErrorBoundary wrapper, and properly named RootComponent with Layout and Outlet.",
  "frontend/src/components/AddFriendsModal.tsx": "Modal dialog for searching users by username and sending friend requests, with search input, scrollable results list showing avatars and usernames, and UserPlus button with sent request tracking (note: has limitation requiring Principal from search results).",
  "frontend/src/components/ChatThread.tsx": "Displays a chat thread with a recipient, showing their profile header with avatar and friend status, a scrollable message history using MessageBubble components, and a MessageInput for sending new messages. Includes auto-scroll on new messages and ability to send friend requests to non-friends.",
  "frontend/src/components/CommentInput.tsx": "Provides a textarea and submit button for authenticated users to post comments on videos. Handles comment submission with validation, loading states, and toast notifications for success/error feedback.",
  "frontend/src/components/CommentSection.tsx": "Displays a scrollable list of video comments with author avatars, usernames, timestamps, and comment text. Shows comment count badge and handles empty state with loading spinner.",
  "frontend/src/components/ConversationList.tsx": "Renders a scrollable list of conversation partners with avatars, last message previews, timestamps, and friend status indicators. Handles selection state and displays loading skeletons or empty state when appropriate.",
  "frontend/src/components/EditProfileModal.tsx": "Modal dialog for editing user profile with fields for username, bio, and profile picture upload with preview. Handles image file validation, converts to ExternalBlob, and submits profile updates with toast notifications.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches rendering errors and displays a fallback UI with error details and a reload button. Logs errors to console for debugging.",
  "frontend/src/components/FollowButton.tsx": "Toggle button for following/unfollowing users with optimistic UI updates, loading states, and validation to prevent self-following. Shows different icons and styles based on follow state and handles authentication checks.",
  "frontend/src/components/FriendRequestsList.tsx": "Displays a list of pending friend requests with accept/decline buttons, showing user avatars and usernames fetched via profile queries.",
  "frontend/src/components/FriendsList.tsx": "Shows the user's friends list in a scrollable area with unfriend functionality, including a confirmation dialog before removing a friend.",
  "frontend/src/components/Layout.tsx": "Main application layout component with sticky header, navigation buttons (Home, Vidles, Upload, Messages, Profile), theme toggle, and login button.",
  "frontend/src/components/LikeButton.tsx": "Interactive like button for videos with optimistic UI updates, showing like count and preventing duplicate likes from authenticated users.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login/logout with loading states and error handling, clearing query cache on logout.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with timestamp, optional video link, and different styling for own vs. received messages.",
  "frontend/src/components/MessageInput.tsx": "Message composition form with textarea, send button, and video attachment picker for sending messages to a specific recipient.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time users to create their profile by entering username and bio, with non-dismissible behavior until completed.",
  "frontend/src/components/ShareButton.tsx": "A button component that copies a video's shareable URL to the clipboard and displays a toast notification on success or failure.",
  "frontend/src/components/VideoCard.tsx": "A comprehensive video card component displaying video metadata, thumbnail, uploader profile, like/share buttons, follow/unfollow functionality, and delete option for own videos with confirmation dialog.",
  "frontend/src/components/VideoGrid.tsx": "A grid layout component for displaying videos as thumbnails with play overlays, Vidle badges, and delete buttons for owned videos with confirmation dialogs.",
  "frontend/src/components/VideoLinkPicker.tsx": "A dialog component that displays a user's uploaded videos in a grid, allowing selection of a video by its ID for linking purposes.",
  "frontend/src/components/VideoUploadModal.tsx": "A modal dialog for uploading videos with form fields for title, description, tags, content type selection (video/vidle), and validation for Vidle format requirements (5s-2:30min duration, 9:16 aspect ratio).",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and manages the backend actor instance based on authentication state, initializing with identity when logged in or returning an anonymous actor otherwise.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing login/logout state, identity persistence, and AuthClient configuration with delegation handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, videos, comments, messages, friend requests, and follows. Includes hooks for getting caller profile, user videos, most liked videos, vidles, video details, comments, messages, friend requests, and mutations for saving profiles, uploading videos, liking, commenting, messaging, and friend management.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark themes using OKLCH color space, custom utility classes for neon glow effects and gradients, and custom scrollbar styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/FeedPage.tsx": "Displays a feed of most liked videos using VideoCard components, shows loading/error states, and conditionally renders ProfileSetupModal for authenticated users without profiles.",
  "frontend/src/pages/MessagingPage.tsx": "Messaging interface with tabs for conversations and friends, displays ConversationList, ChatThread, FriendRequestsList, and FriendsList components with an AddFriendsModal, requires authentication.",
  "frontend/src/pages/ProfilePage.tsx": "Displays user profile with avatar, username, bio, follower/following counts, and a VideoGrid of user's videos. Shows EditProfileModal for own profile or FollowButton for other users.",
  "frontend/src/pages/VideoDetailPage.tsx": "Shows detailed video view with video player, title, description, tags, uploader info, like/share buttons, and CommentSection with CommentInput for authenticated users.",
  "frontend/src/pages/VidlesPage.tsx": "React page component that displays a feed of short-form vertical videos (Vidles), with loading states, error handling, empty state UI, and integration with authentication, user profiles, and profile setup modal.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, neon shadow effects, custom animations, and typography/container plugins for the SkelUlt application.",
  "project_state.json": "Project state document tracking SkelUlt's architecture (multi-platform video hosting with messaging), existing features (authentication, profiles, video upload, engagement), and known issues (white screen, delete button failures, friend requests visibility)."
}