{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add delete button with trash icon for user's own videos",
  "requirements": [
    {
      "id": "REQ-21",
      "summary": "Add trash icon delete button to VideoCard that appears only for authenticated user's own videos",
      "acceptanceCriteria": [
        "Trash icon button is visible on VideoCard components for videos created by the authenticated user",
        "Trash icon button is hidden on videos created by other users",
        "Button is positioned consistently with other action buttons (like, comment, share)",
        "Button uses an appropriate trash/delete icon from the existing icon library"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/VideoCard.tsx",
          "operation": "modify",
          "description": "Add a trash icon delete button to the action buttons row that appears only when the authenticated user's principal matches the video uploader principal. Position it alongside the existing LikeButton, CommentButton, and ShareButton. Use lucide-react's Trash2 icon to match the existing icon style. Include conditional rendering logic using useInternetIdentity hook to compare identity.getPrincipal() with video.uploader. Wire the button to trigger the delete confirmation handler defined in REQ-22."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Implement delete video functionality with confirmation dialog and optimistic UI updates",
      "acceptanceCriteria": [
        "Clicking the trash icon triggers a confirmation dialog asking the user to confirm deletion",
        "Confirming deletion calls the backend deleteVideo mutation with the video ID",
        "Video is removed from the feed/grid immediately after successful deletion using optimistic updates",
        "Error handling displays appropriate toast notifications if deletion fails",
        "Cancel option in confirmation dialog prevents deletion"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a useDeleteVideo mutation hook that calls actor.deleteVideo(videoId) and implements optimistic updates by removing the video from relevant query caches (mostLikedVideos, userVideos). Use queryClient.setQueryData to update cached video lists immediately before the mutation completes. Include onError handler to revert optimistic updates and display error toast. Include onSuccess handler to show success toast and invalidate related queries."
        },
        {
          "path": "frontend/src/components/VideoCard.tsx",
          "operation": "modify",
          "description": "Import and use the useDeleteVideo hook from REQ-22. Add state for managing a confirmation dialog (using shadcn/ui AlertDialog component). When the trash button is clicked, open the AlertDialog with a confirmation message asking 'Are you sure you want to delete this video? This action cannot be undone.' Include Cancel and Delete actions. On confirmation, call the deleteVideo mutation with the video ID. Show loading state on the delete button during mutation."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Add trash icon delete button to VideoGrid thumbnails for authenticated user's own videos",
      "acceptanceCriteria": [
        "Trash icon button appears on video thumbnails in grid view for user's own videos",
        "Button is positioned in a corner of the thumbnail (typically top-right) for easy access",
        "Button triggers the same confirmation and deletion flow as in VideoCard",
        "Button is hidden for videos created by other users"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/VideoGrid.tsx",
          "operation": "modify",
          "description": "Add a trash icon button positioned absolutely in the top-right corner of each video thumbnail. Use lucide-react's Trash2 icon with a semi-transparent dark background for visibility over video thumbnails. Include conditional rendering using useInternetIdentity hook to show the button only when the authenticated user's principal matches the video uploader. Import and use the same useDeleteVideo hook and AlertDialog confirmation pattern from REQ-22. Prevent click event from bubbling to the parent navigation link when the delete button is clicked (using e.stopPropagation())."
        }
      ]
    }
  ]
}