{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Make Pending Friend Requests section visible in SkelMsg",
  "requirements": [
    {
      "id": "REQ-60",
      "summary": "Update MessagingPage component to ensure the FriendRequestsList component is properly rendered and visible in the SkelMsg interface, positioned above or alongside the conversation list in the main layout",
      "acceptanceCriteria": [
        "FriendRequestsList component is visible when MessagingPage loads",
        "Pending friend requests section appears prominently in the SkelMsg interface",
        "The section displays incoming friend requests with accept/decline buttons",
        "Layout accommodates the friend requests section without breaking existing conversation list or friends list"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MessagingPage.tsx",
          "operation": "modify",
          "description": "Add the FriendRequestsList component to the main messaging interface layout. Position it prominently in the Conversations tab, above the ConversationList component. Ensure the component receives the friend requests data from useGetFriendRequests hook and displays properly alongside existing messaging UI elements without breaking the current tab structure."
        }
      ]
    },
    {
      "id": "REQ-61",
      "summary": "Verify that the useGetFriendRequests React Query hook is being called in MessagingPage and properly fetching pending friend requests from the backend",
      "acceptanceCriteria": [
        "useGetFriendRequests hook is invoked in MessagingPage",
        "Friend requests data is fetched and passed to FriendRequestsList component",
        "Loading and error states are handled appropriately",
        "Data refreshes automatically when friend requests change"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MessagingPage.tsx",
          "operation": "modify",
          "description": "Ensure useGetFriendRequests hook is properly invoked in MessagingPage component. Verify the hook fetches pending friend requests and passes the data correctly to FriendRequestsList. Add proper handling for loading, error, and empty states. Ensure the query invalidation works correctly when friend requests are accepted or declined to trigger automatic refresh."
        }
      ]
    },
    {
      "id": "REQ-62",
      "summary": "Add visual styling to the Pending Friend Requests section to make it stand out with a clear heading, appropriate spacing, and consistent neon theme styling matching the rest of SkelMsg",
      "acceptanceCriteria": [
        "Section has a clear 'Pending Friend Requests' heading",
        "Styling matches the neon-inspired theme of SkelUlt",
        "Appropriate spacing between friend request items",
        "Visual hierarchy makes the section easy to identify and use"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MessagingPage.tsx",
          "operation": "modify",
          "description": "Add a styled section wrapper around FriendRequestsList with a clear 'Pending Friend Requests' heading using neon-themed styling consistent with SkelUlt design (neon borders, glow effects). Apply appropriate spacing using Tailwind margin and padding utilities to separate it from the conversation list. Ensure visual hierarchy with text sizing and color contrast that matches the existing neon theme defined in frontend/src/index.css."
        },
        {
          "path": "frontend/src/components/FriendRequestsList.tsx",
          "operation": "modify",
          "description": "Enhance the visual styling of individual friend request items to match the neon-inspired theme. Add appropriate spacing between items, ensure consistent use of neon accents (borders, shadows, hover effects), and verify the accept/decline buttons have proper visual feedback. Maintain consistency with the existing SkelUlt design system defined in frontend/src/index.css and frontend/tailwind.config.js."
        }
      ]
    }
  ]
}