{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add SkelUlt logo and Enable/Disable follow button with animation",
  "requirements": [
    {
      "id": "REQ-40",
      "summary": "Add SkelUlt logo to Layout header with consistent light/dark mode styling",
      "acceptanceCriteria": [
        "Logo appears in the top-left corner of the Layout header",
        "Logo is small and does not overwhelm other header elements",
        "Logo displays with consistent styling in both light and dark theme modes",
        "Logo uses the generated image asset from frontend/public/assets/generated"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Add the SkelUlt logo image to the header's top-left corner using the generated asset at frontend/public/assets/generated/skelult-logo.dim_256x256.png. Position the logo before the navigation links, apply appropriate sizing (small, non-intrusive), and ensure it renders consistently in both light and dark modes without additional styling variations. The logo should link to the feed page for easy navigation to home."
        }
      ]
    },
    {
      "id": "REQ-41",
      "summary": "Add Enable button next to like button on VideoCard for following video creators",
      "acceptanceCriteria": [
        "Enable button appears next to the like button on all video cards",
        "Button text displays 'Enable' when the user is not following the video creator",
        "Clicking the Enable button follows/subscribes to the video creator",
        "Button smoothly animates and transitions to 'Disable' state after clicking"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/VideoCard.tsx",
          "operation": "modify",
          "description": "Add an Enable/Disable button next to the LikeButton in the video card's action button row. Use the existing FollowButton component infrastructure to handle follow/unfollow logic. Position the button between the like button and other action buttons. The button should check if the current user is following the video uploader and display 'Enable' (not following) or 'Disable' (following) accordingly. Include authentication checks to ensure only logged-in users can interact with the button. Verify the FollowButton component's usage instructions before implementing to ensure proper integration with the existing follow system."
        }
      ]
    },
    {
      "id": "REQ-42",
      "summary": "Implement smooth animation for Enable/Disable button state transitions",
      "acceptanceCriteria": [
        "Button smoothly animates when transitioning between Enable and Disable states",
        "Visual transition effects are consistent with the neon-inspired design theme",
        "Animation completes within a reasonable timeframe (300-500ms)",
        "Button remains interactive and responsive during and after animation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/VideoCard.tsx",
          "operation": "modify",
          "description": "Add CSS transition effects to the Enable/Disable button for smooth state changes. Implement a transition animation (300-500ms duration) that includes visual feedback such as background color shift, scale transform, or opacity changes when toggling between Enable and Disable states. Use Tailwind's transition utilities and neon-themed colors from the existing design system (cyan accents, dark/light mode compatible). Ensure the button remains clickable and responsive throughout the animation. The animation should feel polished and consistent with the app's neon-inspired aesthetic."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Implement Disable button functionality for unfollowing video creators",
      "acceptanceCriteria": [
        "Clicking the Disable button unfollows/unsubscribes from the video creator",
        "Button smoothly animates back to 'Enable' state after unfollowing",
        "Follow/unfollow action updates the user's follow list immediately (optimistic UI)",
        "Follow state persists correctly after page refresh"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/VideoCard.tsx",
          "operation": "modify",
          "description": "Implement the unfollow functionality for the Disable button state. When clicked in the Disable state, the button should call the unfollowUser mutation from useQueries hook to unsubscribe from the video creator. Apply optimistic UI updates so the button immediately transitions back to 'Enable' state before the backend confirms the action. Include error handling with toast notifications if the unfollow action fails. Ensure the follow state persists correctly by relying on the existing React Query cache invalidation patterns in useQueries. The button should animate smoothly back to the Enable state using the same transition effects defined in REQ-42."
        }
      ]
    }
  ]
}